{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.2,
  "bos_token_id": 0,
  "classifier_dropout": 0.1,
  "eos_token_ids": 0,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.2,
  "hidden_size": 768,
  "id2label": {
    "0": "Non-Disclosure Agreement (NDA)",
    "1": "Service Agreement",
    "2": "unknown",
    "3": "Employment Contract"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Employment Contract": 3,
    "Non-Disclosure Agreement (NDA)": 0,
    "Service Agreement": 1,
    "unknown": 2
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.51.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
